Temporal Return Addresses: Exploitation Chronomancy
skape
mmiller@hick.org
Last modified: 8/6/2005
    

1) Foreword

Abstract: Nearly all existing exploitation vectors depend on some knowledge of
a process' address space prior to an attack in order to gain meaningful
control of execution flow.  In cases where this is necessary, exploit authors
generally make use of static addresses that may or may not be portable between
various operating system and application revisions.  This fact can make
exploits unreliable depending on how well researched the static addresses were
at the time that the exploit was implemented.  In some cases, though, it may
be possible to predict and make use of certain addresses in memory that do not
have static contents.  This document introduces the concept of temporal
addresses and describes how they can be used, under certain circumstances, to
make exploitation more reliable.

Disclaimer: This document was written in the interest of education.  The
author cannot be held responsible for how the topics discussed in this
document are applied.

Thanks: The author would like to thank H D Moore, spoonm, thief, jhind,
johnycsh, vlad902, warlord, trew, vax, uninformed, and all the friends of
nologin!

With that, on with the show...


2) Introduction

A common impediment to the implementation of portable and reliable exploits is
the location of a return address. It is often required that a specific

requirements and make it possible to make use of temporal addresses that have
a scale that is measured from an absolute time.  According to the RFC, though,
if a system is unable to determine the number of milliseconds since UT then it
can use another value capable of representing time (though it must set a
high-order bit to indicate the non-standard value).


5.1.3) IP Timestamp Option

Like the ICMP TIMESTAMP request, IP also has a timestamp option (type 68) that
measures the number of milliseconds since midnight UT. This could also be used
to determine down to a millisecond resolution what the remote system's clock
is set to.  Since the measurement is the same, the limitations are the same as
ICMP's TIMESTAMP request.


5.1.4) HTTP Server Date Header

In scenarios where a target machine is running an HTTP server, it may be
possible to extract the system time by simply sending an HTTP request and
checking to see if the response contains a date header or not.  Figure  shows
an example HTTP response that contains a date header.


5.1.5) IRC CTCP TIME

Perhaps one of the more lame approaches to obtaining a target machine's time
is by issuing a CTCP TIME request over IRC.  This request is designed to
instruct the responder to reply with a readable date string that is relative
to the responder's system time. Unless spoofed, the response should be
equivalent to the system time on the remote machine.


6) Determining the Return Address

Once all the preliminary work of calculating all of the viable opcode windows
has been completed and a target machine's system time has been determined, the
final step is to select the next available window for a compatible opcode
group.  For instance, if the next window for a jmp esp equivalent instruction
is Sun Sep 25 22:37:28 CDT 2005, then the byte index to the start of the jmp
esp equivalent must be determined based on the permutation that was generated.
In this case, the permutation that would have been generated (assuming a
100nanosecond period since 1601) is 0x01c5c25400000000.  This means that jmp
esp equivalent is actually a push esp, ret which starts at byte index four.
If the start of the temporal address was at 0x7ffe0014, then the return
address that should be used in order to get the push esp, ret to execute would
be 0x7ffe0018.  This basic approach is common to all temporal addresses of
varying capacity, period, and scale.


7) Case Study: Windows NT SharedUserData

With all the generic background information out of the way, a real world
practical use of this technique can be illustrated through an analysis of a
region of memory that happens to be found in every process on Windows NT+.
This region of memory is referred to as SharedUserData and has a backward
compatible format for all versions of NT, though new fields have been appended
over time. At present, the data structure that represents SharedUserData is
KUSERSHAREDDATA which is defined as follows on Windows XP SP2:


0:000> dt _KUSER_SHARED_DATA
   +0x000 TickCountLow : Uint4B
   +0x004 TickCountMultiplier : Uint4B
   +0x008 InterruptTime : _KSYSTEM_TIME
   +0x014 SystemTime : _KSYSTEM_TIME
   +0x020 TimeZoneBias : _KSYSTEM_TIME
   +0x02c ImageNumberLow : Uint2B
   +0x02e ImageNumberHigh : Uint2B
   +0x030 NtSystemRoot : [260] Uint2B
   +0x238 MaxStackTraceDepth : Uint4B
   +0x23c CryptoExponent : Uint4B
   +0x240 TimeZoneId : Uint4B
   +0x244 Reserved2 : [8] Uint4B
   +0x264 NtProductType : _NT_PRODUCT_TYPE
   +0x268 ProductTypeIsValid : UChar
   +0x26c NtMajorVersion : Uint4B
   +0x270 NtMinorVersion : Uint4B
   +0x274 ProcessorFeatures : [64] UChar
   +0x2b4 Reserved1 : Uint4B
   +0x2b8 Reserved3 : Uint4B
   +0x2bc TimeSlip : Uint4B
   +0x2c0 AlternativeArchitecture : _ALTERNATIVE_ARCHITECTURE_TYPE
   +0x2c8 SystemExpirationDate : _LARGE_INTEGER
   +0x2d0 SuiteMask : Uint4B
   +0x2d4 KdDebuggerEnabled : UChar
   +0x2d5 NXSupportPolicy : UChar
   +0x2d8 ActiveConsoleId : Uint4B
   +0x2dc DismountCount : Uint4B
   +0x2e0 ComPlusPackage : Uint4B
   +0x2e4 LastSystemRITEventTickCount : Uint4B
   +0x2e8 NumberOfPhysicalPages : Uint4B
   +0x2ec SafeBootMode : UChar
   +0x2f0 TraceLogging : Uint4B
   +0x2f8 TestRetInstruction : Uint8B
   +0x300 SystemCall : Uint4B
   +0x304 SystemCallReturn : Uint4B
   +0x308 SystemCallPad : [3] Uint8B
   +0x320 TickCount : _KSYSTEM_TIME
   +0x320 TickCountQuad : Uint8B
   +0x330 Cookie : Uint4B


One of the purposes of SharedUserData is to provide processes with a global
and consistent method of obtaining certain information that may be requested
frequently, thus making it more efficient than having to incur the performance
hit of a system call.  Furthermore, as of Windows XP, SharedUserData acts as
an indirect system call re-director such that the most optimized system call
instructions can be used based on the current hardware's support, such as by
using sysenter over the standard int 0x2e.

As can be seen right off the bat, SharedUserData contains a few fields that
pertain to the timing of the current system.  Furthermore, if one looks
closely, it can be seen that these timer fields are actually updated
constantly as would be expected for any timer variable:


0:000> dd 0x7ffe0000 L8
7ffe0000 055d7525 0fa00000 93fd5902 00000cca
7ffe0010 00000cca a78f0b48 01c59a46 01c59a46
0:000> dd 0x7ffe0000 L8
7ffe0000 055d7558 0fa00000 9477d5d2 00000cca
7ffe0010 00000cca a808a336 01c59a46 01c59a46
0:000> dd 0x7ffe0000 L8
7ffe0000 055d7587 0fa00000 94e80a7e 00000cca
7ffe0010 00000cca a878b1bc 01c59a46 01c59a46


The three timing-related fields of most interest are TickCountLow,
InterruptTime, and SystemTime.  These three fields will be explained
individually later in this chapter.  Prior to that, though, it is important to
understand some of the properties of SharedUserData and why it is that it's
quite useful when it comes to temporal addresses.


7.1) The Properties of SharedUserData

There are a number of important properties of SharedUserData, some of
which make it useful in terms of temporal addresses and others that make it
somewhat infeasible depending on the exploit or hardware support.  As far as
the properties that make it useful go, SharedUserData is located at a static
address, 0x7ffe0000, in every version of Windows NT+.  Furthermore,
SharedUserData is mapped into every process.  The reasons for this are that
NTDLL, and most likely other 3rd party applications, have been compiled and
built with the assumption that SharedUserData is located at a fixed address.
This is something many people are abusing these days when it comes to passing
code from kernel-mode to user-mode. On top of that, SharedUserData is required
to have a backward compatible data structure which means that the offsets of
all existing attributes will never shift, although new attributes may be, and
have been, appended to the end of the data structure. Lastly, there are a few
products for Windows that implement some form of ASLR. Unfortunately for these
products, SharedUserData cannot be feasibly randomized, or at least the author
is not aware of any approaches that wouldn't have severe performance impacts.

On the negative side of the house, and perhaps one of the most limiting
factors when it comes to making use of SharedUserData, is that it has a null
byte located at byte index one.  Depending on the vulnerability, it may or may
not be possible to use an attribute within SharedUserData as a return address
due to NULL byte restrictions.  As of XP SP2 and 2003 Server SP1,
SharedUserData is no longer marked as executable and will result in a DEP
violation (if enabled) assuming the hardware supports PAE.  While this is not
very common yet, it is sure to become the norm over the course of time.


7.2) Locating Temporal Addresses

As seen previously in this document, using the telescope program on any
Windows application will result in the same two (or three) timers being
displayed:


C:\>telescope 2620
[*] Attaching to process 2620 (5 polling cycles)...
[*] Polling address space........

Temporal address locations:
0x7FFE0000 [Size=4, Scale=Counter, Period=600 msec]
0x7FFE0014 [Size=8, Scale=Epoch (1601), Period=100 nsec]


Referring to the structure definition described at the beginning of this
chapter, it is possible for one to determine which attribute each of these
addresses is referring to.  Each of these three attributes will be discussed
in detail in the following sub-sections.


7.2.1) TickCountLow

The TickCountLow attribute is used, in combination with the
TickCountMultiplier, to convey the number of milliseconds that have occurred
since system boot.  To calculate the number of milliseconds since system boot,
the following equation is used:


   T = shr(TickCountLow * TickCountMultiplier, 24)


This attribute is representative of a temporal address that has a counter
scale.  It starts an unknown time and increments at constant intervals.  The
biggest problem with this attribute are the intervals that it increases at.
It's possible that two machines in the same room with different hardware will
have different update periods for the TickCountLow attribute.  This makes it
less feasible to use as a temporal address because the update period cannot be
readily predicted.  On the other hand, it may be possible to determine the
current uptime of the machine through TCP timestamps or some alternative
mechanism, but without the ability to determine the update period, the
TickCountLow attribute seems unusable.

This attribute is located at 0x7ffe0000 on all versions of Windows NT+.


7.2.2) InterruptTime

This attribute is used to store a 100 nanosecond timer starting at system boot
that presumably counts the amount of time spent processing interrupts. The
attribute itself is stored as a KSYSTEMTIME structure which is defined as:


0:000> dt _KSYSTEM_TIME
   +0x000 LowPart : Uint4B
   +0x004 High1Time : Int4B
   +0x008 High2Time : Int4B


Depending on the hardware a machine is running, the InterruptTime's period may
be exactly equal to 100 nanoseconds.  However, testing has seemed to confirm
that this is not always the case.  Given this, both the update period and the
scale of the InterruptTime attribute should be seen as limiting factors. This
fact makes it less useful because it has the same limitations as the
TickCountLow attribute.  Specifically, without knowing when the system booted
and when the counter started, or how much time has been spent processing
interrupts, it is not possible to reliably predict when certain bytes will be
at certain offsets. Furthermore, the machine would need to have been booted
for a significant amount of time in order for some of the useful instructions
to be feasibly found within the bytes that compose the timer.

This attribute is located at 0x7ffe0008 on all versions of Windows NT+.


7.2.3) SystemTime

