GREPEXEC: Grepping Executive Objects from Pool Memory
bugcheck
chris@bugcheck.org 

1) Foreword

Abstract:

As rootkits continue to evolve and become more advanced, methods that can be
used to detect hidden objects must also evolve.  For example, relying on system
provided APIs to enumerate maintained lists is no longer enough to provide
effective cross-view detection.  To that point, scanning virtual memory for
object signatures has been shown to provide useful, but limited, results.  The
following paper outlines the theory and practice behind scanning memory for
hidden objects.  This method relies upon the ability to safely reference the
Windows system virtual address space and also depends upon the building and
locating effective memory signatures.  Using this method as a base, suggestions
are made as to what actions might be performed once objects are detected.  The
paper also provides a simple example of how object-independent signatures can be
built and used to detect several different kernel objects on all versions of
Windows NT+.  Due to time constraints, the source code associated with this
paper will be made publicly available in the near future.

Thanks:

Thanks to skape, Peter, and the rest of the uninformed hooligans;
you guys and gals rock!

Disclaimer:

The author is not responsible for how the papers contents are used
or interpreted. Some information may be inaccurate or incorrect. If
the reader feels any information is incorrect or has not been

rootkits such as FU were detected using various methods
which exploited its weak and proof-of-concept design by applications
such as Blacklight.  These specific weaknesses were
addressed in FUTo.  However, some still remain excluding
the topic of this paper.

RAIDE, a rootkit detection tool, uses a memory
signature scanning method in order to find EPROCESS blocks hidden by
FUTo. This specific implementation works, however, it too has its
weaknesses. This paper attempts to outline the general concepts of
implementing a successful rootkit detection method using memory
signatures.

The following chapters will discuss how to safely enumerate system
memory, what to look for when building a memory signature, what to
do once a memory signature has been found, and potential methods of
breaking memory signatures.  Finally, an accompanying tool will be used
to concretely illustrate the subject of this paper.

After reading the following paper, the reader should have an
understanding of the concepts and issues related to kernel object
detection using memory signatures. The author believes this to be an
acceptable method of rootkit detection.  However, as with most things
in the security realm, no one technique is the ultimate solution and
this technique should only be considered complimentary to other known
detection methods.


3) Scanning Memory

Enumerating arbitrary system memory is nowhere near a science since
its state can change at anytime while you are attempting to access
it. While this is true, the memory that surrounds kernel executive
objects should be fairly consistent.  With proper care, memory accesses
should be safe and the chance of false positives and negatives should be
fairly minimal. The following sections will outline a safe method to
enumerate the contents of both the system's PagedPool and
NonPagedPool.

3.1) Retrieving Pool Ranges

For the purpose of enumerating pool memory it is unnecessary to
enumerate the entire system address space. The system maintains a
few global variables such as nt!MmPagedPoolStart,
nt!MmPagedPoolEnd and related NonPagedPool
variables that can be used in order to speed up a search and reduce
the possibility of unnecessary false positives. Although these
global variables are not exported, there are a couple ways in that
they can be obtained.

The most reliable method on modern systems (Windows XP Service Pack 2
and up) is through the use of the KPCR->KdVersionBlock pointer located
at fs:[0x34].  This points to a KDDEBUGGER_DATA64 structure which is
defined in the Debugging Tools For Windows SDK header file wdbgexts.h.
This structure is commonly used by malicious software in order to gain
access to non-exported global variables to manipulate the system.

A second method to obtain PagedPool values is to reference the
per-session nt!_MM_SESSION_SPACE found at EPROCESS->Session. This contains
information about the session owning the process, including its ranges
and many other PagedPool related values shown here.

kd> dt nt!_MM_SESSION_SPACE
   +0x01c NonPagedPoolBytes : Uint4B
   +0x020 PagedPoolBytes   : Uint4B
   +0x024 NonPagedPoolAllocations : Uint4B
   +0x028 PagedPoolAllocations : Uint4B
   +0x044 PagedPoolMutex   : _FAST_MUTEX
   +0x064 PagedPoolStart   : Ptr32 Void
   +0x068 PagedPoolEnd     : Ptr32 Void
   +0x06c PagedPoolBasePde : Ptr32 _MMPTE
   +0x070 PagedPoolInfo    : _MM_PAGED_POOL_INFO
   +0x244 PagedPool        : _POOL_DESCRIPTOR

While enumerating the entire system address space is not preferable, it
can still be used in situations where pool information cannot be
obtained.  The start of the system address space can be assumed to be
any address above nt!MmHighestUserAddress.  However, it would appear
that an even safer assumption would be the address following the
LARGE_PAGE where ntoskrnl.exe and hal.dll are mapped. This can be
obtained by using any address exported by hal.dll and rounding up to the
nearest large page.


3.2) Locking Memory

When accessing arbitrary memory locations, it is important that pages be
locked in memory prior to accessing them.  This is done to ensure that
accessing the page can be done safely and will not cause an exception
due to a race condition, such as if it were to be de-allocated between a
check and a reference.  The system provides a routine to lock pages
named nt!MmProbeAndLockPages. This routine can be used to lock either
pagable or non-paged memory. Since physical pages maintain a reference
count in the nt!MmPfnDatabase there is no worry of an outside source
unlocking the pages and having them page out to disk or become invalid.

In order to use MmProbeAndLockPages, a caller must first build an MDL
structure using something such as nt!IoAllocateMdl or
nt!MmInitializeMdl.  The MDL creation routines are passed a virtual
address and length describing the block of virtual memory to be
referenced. On a successful call to nt!MmProbeAndLockPages, the virtual
address range described by the MDL structure is safe to access. Once the
block is no longer needed to be accessed, the pages must be unlocked
using nt!MmUnlockPages.

A trick can be used to further reduce the number of pages locked when
enumerating the NonPagedPool. As documented, MmProbeAndLockPages can be
called at DISPATCH_LEVEL with the limitation of it only being allowed to
lock resident memory pages and failing otherwise, which is a desirable
side-effect in this case.


4) Detecting Executive Objects

In general, all of the executive components of the NT kernel rely on the
object manager in order to manage the objects they allocate. All objects
allocated by the object manager have a common header named OBJECT_HEADER
and additional optional headers such as OBJECT_HEADER_NAME_INFO, process
quota information, and handle trace information. Let's take a look to
see what is common to all executive objects and how we can use the pool
block header information to identify an allocated executive object.
Lastly, some object specific information will be discussed in terms of
generating a useful memory signature for an object.

4.1) Generic Object Information

Since the OBJECT_HEADER is common to all objects, let's look at it in
detail. A static field here refers to all objects of specific type, not
all executive objects in the system.

kd> dt _OBJECT_HEADER
   +0x000 PointerCount     : Int4B
   +0x004 HandleCount      : Int4B
   +0x004 NextToFree       : Ptr32 Void
   +0x008 Type             : Ptr32 _OBJECT_TYPE
   +0x00c NameInfoOffset   : UChar
   +0x00d HandleInfoOffset : UChar
   +0x00e QuotaInfoOffset  : UChar
   +0x00f Flags            : UChar
   +0x010 ObjectCreateInfo : Ptr32 _OBJECT_CREATE_INFORMATION
   +0x010 QuotaBlockCharged : Ptr32 Void
   +0x014 SecurityDescriptor : Ptr32 Void
   +0x018 Body             : _QUAD

  -------------------+------------+-------------------------------------
  PointerCount       | Variable   |  of references 
  HandleCount        | Variable   |  of open handles 
  NextToFree         | NotValid   | Used when freed 
  Type               | Static     | Pointer to OBJECTTYPE 
  NameInfoOffset     | Static     | 0 or offset to related header 
  HandleInfoOffset   | Static     | 0 or offset to related header 
  QuotaInfoOffset    | Static     | 0 or offset to related header 
  Flags              | NotCertain | Not certain 
  ObjectCreateInfo   | Variable   | Pointer to OBJECTCREATEINFORMATION 
  QuotaBlockCharged  | NotCertain | Not certain 
  SecurityDescriptor | Variable   | Pointer to SECURITYDESCRIPTOR 
  Body               | NotValid   | Union with the actual object 
  -------------------+------------+-------------------------------------

From this it is assumed that the most reliable and unique signature is
the Type field of the OBJECT_HEADER which could be used in order to
identify objects of a specific type such as EPROCESS, ETHREAD,
DRIVER_OBJECT, and DEVICE_OBJECT objects.


4.2) Validating Pool Block Information
    
Kernel pool management appears to be slightly different from usermode
heap management.  However, if one assumes that the only concern is
dealing with pool memory allocations which are less then PAGE_SIZE, it is
fairly similar.  Each call to ExAllocatePoolWithTag() returns a
pre-buffer header as follows:

kd> dt _POOL_HEADER
   +0x000 PreviousSize     : Pos 0, 9 Bits
   +0x000 PoolIndex        : Pos 9, 7 Bits
   +0x002 BlockSize        : Pos 0, 9 Bits
   +0x002 PoolType         : Pos 9, 7 Bits
   +0x000 Ulong1           : Uint4B
   +0x004 ProcessBilled    : Ptr32 _EPROCESS
   +0x004 PoolTag          : Uint4B
   +0x004 AllocatorBackTraceIndex : Uint2B
   +0x006 PoolTagHash      : Uint2B

For the purposes of locating objects, the following is a breakdown of
what could be useful. Again, static refers to fields common between similar
executive objects and not all allocated POOL_HEADER structures.


  ------------------------+------------+----------------------------------
  PreviousSize            | Variable   | Offset to previous pool block 
  PoolIndex               | NotCertain | Not certain 
  BlockSize               | Static     | Size of pool block 
  PoolType                | Static     | POOL_TYPE 
  Ulong1                  | Union      | Padding, not valid 
  ProcessBilled           | Variable   | Allocator EPROCESS when no Tag specified 
  PoolTag                 | Static     | Pool Tag (ULONG) 
  AllocatorBackTraceIndex | NotCertain | Not certain 
  PoolTagHash             | NotCertain | Not certain 
  ------------------------+------------+----------------------------------

